// general message
"message.error.default" = "Có lỗi trong quá trình xử lý.\nVui lòng thử lại.";
"message.otp.required" = "Vui lòng nhập OTP";
"message.error.invalid-enter-again" = "%@ không hợp lệ.\nVui lòng nhập lại.";
"message.cvv.required" = "Vui lòng nhập CVV/CVC/CVN";
"invalid-authentication" = "Lỗi xác thực.\nVui lòng thử lại.";

// payment method
"payment-method.ewallet" = "Ví điện tử Payoo";
"payment-method.international-card" = "Thẻ quốc tế";
"payment-method.domestic-card" = "Thẻ nội địa";
"payment-method.pay@store" = "Điểm giao dịch";
"payment-method.installment" = "Trả góp bằng thẻ tín dụng";

// placeholder
"place-holder.%@-number-of-digits" = "%@ số";
"place-holder.card-holder-name" = "Nhập không dấu";
"place-holder.card-input.phone" = "Nhận hỗ trợ và khuyến mãi (nếu có)";
"place-holder.installment.period" = "Vui lòng chọn kỳ hạn trả góp";

// title
"info.title-table.contact" = "THÔNG TIN LIÊN HỆ";
"info.title-table.card" = "THÔNG TIN THẺ";
"info.title-table.payment" = "THÔNG TIN THANH TOÁN";

// fields
"fullname" = "Họ tên";
"issuance-date" = "Ngày phát hành";
"expiry-date" = "Ngày hết hạn";
"card-holder-name" = "Tên in trên thẻ";
"phone" = "Số điện thoại";
"email" = "Email";
"card-type" = "Loại thẻ";
"payment" = "Thanh toán";
"fee" = "Phí";
"total" = "Tổng tiền";
"estimated-amount" = "Tạm tính";
"card-number" = "Số thẻ";
"supported-banks" = "Ngân hàng hỗ trợ";
"payment-code" = "Mã đơn hàng";
"please-pay-by" = "Thanh toán trước";
"order-no" = "Mã đơn hàng";
"cash-amount" = "Số tiền";
"order-info-notice" = "Quý khách có thể ghi lại hoặc chụp màn hình để lưu thông tin nếu không nhận được tin nhắn hoặc email.";
"finding-store-notice" = "Sau khi nhận mã thanh toán, Quý khách cung cấp mã cho giao dịch viên tại cửa hàng gần nhà để thanh toán:";
"account-no" = "Số tài khoản";
"cvv" = "CVV/CVC/CVN";
"period" = "Kỳ hạn trả góp";

// general button title
"button.title.ok" = "Đồng ý";
"button.title.cancel" = "Hủy";
"button.title.close" = "Đóng";
"button.title.retry" = "Thử lại";
"button.title.continue" = "Tiếp tục";
"button.title.pay" = "Thanh toán";
"button.title.leave" = "Rời khỏi";
"button.title.find-store-near-you" = "Tìm cửa hàng gần Bạn";

// general alert title
"alert.title.error" = "Lỗi";
"alert.title.confirm" = "Xác nhận";
"alert.title.success" = "Thành công";
"alert.title.message" = "Thông báo";

// screen title
"screen.title.payment-method" = "Hình thức thanh toán";
"screen.title.domestic-card-number" = "Nhập số thẻ";
"screen.title.domestic-card-info" = "Nhập thông tin thẻ";
"screen.title.international-card-info" = "Nhập thông tin thẻ";
"screen.title.confirm" = "Xác nhận thanh toán";
"screen.title.select-payment-card" = "Chọn thẻ thanh toán";
"screen.title.contact-info" = "Thông tin liên hệ";
"screen.title.payment-code" = "Mã thanh toán";

// validate
"validate.invalid.card-number" = "Số thẻ không hợp lệ.";
"validate.invalid.card-number-range" = "Số thẻ từ %d đến %d số.\nVui lòng nhập lại.";
"validate.invalid.card-number-length" = "Số thẻ gồm %@ số.\nVui lòng nhập lại.";
"validate.invalid.holder-name" = "Họ tên không hợp lệ. Họ tên có tối đa 50 ký tự, không dấu và có ít nhất một khoảng trắng ở giữa.";
"validate.date.month-greater-than-12" = "Vui lòng nhập tháng từ 1 đến 12.";
"validate.invalid.phone" = "Số điện thoại gồm 10 hoặc 11 số.\nVui lòng nhập lại.";
"validate.invalid.cvv" = "CVV/CVC/CVN không hợp lệ. Vui lòng nhập 3 số cuối ở mặt sau thẻ.";
"validate.invalid-card-info-or-not-support" = "Thông tin thẻ không hợp lệ hoặc thuộc ngân hàng chưa được hỗ trợ.";

// payment
"payment.amount-under-min" = "Số tiền thanh toán nhỏ hơn giới hạn định mức của ngân hàng.";
"payment.amount-greater-max" = "Số tiền thanh toán lớn hơn giới hạn định mức của ngân hàng.";
"payment.deposit-times-greater-max-per-day" = "Số lần nạp tiền trong một ngày lớn hơn giới hạn định mức của ngân hàng.";
"payment.deposit-money-greater-max-per-day" = "Tổng tiền thanh toán trong một ngày lớn hơn giới hạn định mức của ngân hàng.";
"payment.wallet-not-activated" = "VĐT của Bạn chưa kích hoạt. Vui lòng kiểm tra email và kích hoạt Ví.";
"payment.wallet-locked" = "VĐT của Bạn hiện đang bị tạm khóa. Vui lòng liên hệ Bộ phận Hỗ trợ khách hàng để được trợ giúp.";
"payment.wallet-locked-forever" = "VĐT của Bạn hiện đang bị khóa. Vui lòng liên hệ Bộ phận Hỗ trợ khách hàng để được trợ giúp.";
"payment.invalid-card-number" = "Số thẻ không đúng. Quý khách vui lòng kiểm tra lại.";
"payment.invalid-card-name" = "Tên in trên thẻ không đúng. Quý khách vui lòng kiểm tra lại.";
"payment.invalid-card-issuance-date" = "Ngày phát hành thẻ không đúng. Quý khách vui lòng kiểm tra lại.";
"payment.invalid-card-expiry-date" = "Ngày hết hạn không đúng. Quý khách vui lòng kiểm tra lại.";
"payment.invalid-account" = "Tài khoản không đúng. Quý khách vui lòng kiểm tra lại.";
"payment.expired-token" = "Thao tác của Bạn vượt quá thời gian qui định. Vui lòng thực hiện lại qui trình.";
"payment.locked-card" = "Thẻ đã hết hạn hoặc bị khóa. Vui lòng liên hệ ngân hàng phát hành thẻ của Quý khách để được hỗ trợ.";
"payment.locked-account" = "Tài khoản bị khóa. Vui lòng liên hệ ngân hàng phát hành thẻ của Quý khách để được hỗ trợ.";
"payment.card-not-registered" = "Thẻ chưa đăng ký (hoặc chưa hỗ trợ) giao dịch thanh toán trực tuyến. Vui lòng liên hệ ngân hàng phát hành thẻ của Quý khách để được hỗ trợ.";
"payment.limited-payment" = "Tài khoản/Thẻ không đủ số dư hoặc đã vượt quá hạn mức thanh toán.";
"payment.money-not-enough" = "Tài khoản/Thẻ không đủ số dư hoặc đã vượt quá hạn mức thanh toán.";
"payment.invalid-card-info" = "Thông tin thẻ không đúng. Quý khách vui lòng kiểm tra lại.";
"payment.payment-fee-null" = "Dịch vụ/Nhà cung cấp này không chấp nhận thanh toán có tính phí. Vui lòng thanh toán qua hình thức khác.";
"payment.card-transtype-out-limit" = "Thẻ %@ đã hết hạn mức thanh toán trên ứng dụng (%@/%@).";
"payment.device-transtype-out-limit" = "Thiết bị này đã hết hạn mức thanh toán trên ứng dụng (%@/%@).";
"payment.card-out-limit-app" = "Thẻ %@ đã hết hạn mức thanh toán trên ứng dụng (%@/%@).";
"payment.device-out-limit-app" = "Thiết bị này đã hết hạn mức thanh toán trên ứng dụng (%@/%@).";
"payment.card-out-limit" = "Thẻ %@ đã hết hạn mức thanh toán (%@/%@).";
"payment.device-out-limit" = "Thiết bị này đã hết hạn mức thanh toán (%@/%@).";
"payment.installment.%@-bank.amount-under-%@-min" = "%@ áp dụng trả góp với đơn hàng từ %@";
"payment.installment.%@-bank.amount-greater-%@-max" = "%@ áp dụng trả góp với đơn hàng tối đa %@";

// otp
"otp.invalid-repay" = "Mã xác thực OTP Bạn nhập không đúng hoặc đã hết hiệu lực. Vui lòng thực hiện lại giao dịch.";

// webview
"webview.close.confirm" = "Giao dịch chưa được hoàn tất. Bạn có chắc muốn rời khỏi trang?";

// select payment card
"payment-card.other-method" = "Hình thức thanh toán khác";

"payment-method.title.select-bank" = "Chọn ngân hàng";

// save card option view
"label.save-card.description" = "Lưu thông tin thẻ để sử dụng cho những lần thanh toán sau.";

"payment-token.remove.confirm" = "Bạn có chắc muốn xóa thẻ này?";
"payment-token.remove.success" = "Xóa thẻ thành công!";
